app/views/dogs/edit.html.erb

SELECT "owners".* FROM "owners"
---

  <p>Owner: <%= form.select :owner_id, Owner.all.map { |owner| [ owner.to_s, owner.id ] } %></p>