app/controllers/owners_controller.rb

    def create
      @owner = Owner.create(owner_params)
---
INSERT INTO "owners" ("first_name", "last_name", "occupation", "age", "img", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def current_owner
      @owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]